---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementIntersectsFilter
source: html/775e3b81-860d-4537-0336-c9b1d4faa4a0.htm
---
# ElementIntersectsFilter Methods

Identifies if the input element is of a category supported by element intersection filters.